01_basic/2

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pub="http://www.schneider-electric.com/oreo/onedownload/publish">
   <soapenv:Header/>
   <soapenv:Body>
      <pub:CommunicatePublishChangeEvent>
         <pub:publishEvent>
            <pub:sourceSystem>EDMS</pub:sourceSystem>
            <pub:action>PUBLISH</pub:action>
            <pub:timeStamp>2019-09-28T12:26:33.188-05:00</pub:timeStamp>
            <pub:publishedDocument>
               <pub:LocalizedCommercialReferences>
                <pub:LocalizedCommercialReference>
                  <pub:Locale>GB</pub:Locale>
                     <pub:LanguageEDMSId>859</pub:LanguageEDMSId>
                   <pub:CommercialReferences>
                <pub:CommercialReference>
             <pub:CommercialReference>DQ_SSO_PRODUCT_08</pub:CommercialReference>
                <pub:DefaultImage>true</pub:DefaultImage>
               <pub:DocProductType>MAIN</pub:DocProductType>
             </pub:CommercialReference>
           </pub:CommercialReferences>
          </pub:LocalizedCommercialReference>
           <pub:LocalizedCommercialReference>
             <pub:Locale>FR</pub:Locale>
                <pub:LanguageEDMSId>863</pub:LanguageEDMSId>
                <pub:CommercialReferences>
                <pub:CommercialReference>
                  <pub:CommercialReference>DQ_SSO_product_10</pub:CommercialReference>
                      <pub:DefaultImage>true</pub:DefaultImage>
                         <pub:DocProductType>MAIN</pub:DocProductType>
                       </pub:CommercialReference>
                     </pub:CommercialReferences>
                  </pub:LocalizedCommercialReference>
                </pub:LocalizedCommercialReferences>
               <pub:Ranges>
                   <pub:Range>
                     <pub:RangeID>66146</pub:RangeID>
                  </pub:Range>
                  <pub:Range>
                     <pub:RangeID>548</pub:RangeID>
                  </pub:Range>
                  <pub:Range>
                     <pub:RangeID>515</pub:RangeID>
                  </pub:Range>
               </pub:Ranges>
               <pub:LocalizedProperties>
                  <pub:LocalizedProperty>
                     <pub:LanguageName>en_GB</pub:LanguageName>
                     <pub:Title>DQ_SSO_Title</pub:Title>
                     <pub:Description>SSO_Description</pub:Description>
                     <pub:Remarks>DQ_SSO_REMAKRS</pub:Remarks>
                     <pub:LanguageID>859</pub:LanguageID>
                  </pub:LocalizedProperty>
                  <pub:LocalizedProperty>
                     <pub:LanguageName>zh_CN</pub:LanguageName>
                     <pub:Title>DQ_SSO_Title</pub:Title>
                     <pub:Description>DQ_SSO_Description</pub:Description>
                     <pub:Remarks>DQ_SSO_Remarks</pub:Remarks>
                     <pub:LanguageID>855</pub:LanguageID>
                  </pub:LocalizedProperty>
               </pub:LocalizedProperties>
               <pub:FileId>11502518</pub:FileId>
               <pub:GroupId>11502518</pub:GroupId>
               <pub:Title>DQ_SSO_DOC_13</pub:Title>
               <pub:Reference>DQ_SSO_DOC_13</pub:Reference>
               <pub:VersionNumber>1.0</pub:VersionNumber>
              <pub:DocumentDate>2023-09-04T10:55:18.443+00:00</pub:DocumentDate>
               <pub:PartNumber>990-0565A</pub:PartNumber>
               <pub:FileType>0</pub:FileType>
               <pub:ModifiedAt>2016-05-30T12:27:25.396-05:00</pub:ModifiedAt>
               <pub:Country>
                  <pub:CountryName>International</pub:CountryName>
                  <pub:CountryID>883</pub:CountryID>
               </pub:Country>
               <pub:Audience>
                  <pub:Audience>Public</pub:Audience>
                  <pub:AudienceID>74</pub:AudienceID>
               </pub:Audience>
               <pub:DocumentType>
                  <pub:DocumentType>CAD</pub:DocumentType>
                  <pub:DocumentTypeID>23</pub:DocumentTypeID>
               </pub:DocumentType>
               <pub:Organization/>
               <pub:Author>
                  <pub:DocAuthor>SSO</pub:DocAuthor>
               </pub:Author>
               <pub:AvailableOnlyForList>
                  <pub:GenericKeyValue>
                     <pub:Label>International</pub:Label>
                     <pub:Id>883</pub:Id>
                  </pub:GenericKeyValue>
                  <pub:GenericKeyValue>
                     <pub:Label>France</pub:Label>
                     <pub:Id>3</pub:Id>
                  </pub:GenericKeyValue>
                  <pub:GenericKeyValue>
                     <pub:Label>China</pub:Label>
                     <pub:Id>19</pub:Id>
                  </pub:GenericKeyValue>
               </pub:AvailableOnlyForList>
               <pub:ApplicationList>
                  <pub:GenericKeyValue>
                     <pub:Label>86</pub:Label>
                     <pub:Id>17140415</pub:Id>
                  </pub:GenericKeyValue>
               </pub:ApplicationList>
               <pub:Programs>
                  <pub:GenericKeyValue>
                     <pub:Label>EcoXpert</pub:Label>
                     <pub:Id>16620973</pub:Id>
                  </pub:GenericKeyValue>
                  <pub:GenericKeyValue>
                     <pub:Label>SKM</pub:Label>
                     <pub:Id>12873716934</pub:Id>
                  </pub:GenericKeyValue>
               </pub:Programs>
              <pub:ChannelList>
                  <pub:Channel>
                     <pub:Id>47705265060</pub:Id>
                  </pub:Channel>
                   <pub:Channel>
                     <pub:Id>47705265062</pub:Id>
                  </pub:Channel>
               </pub:ChannelList>
<!--               <pub:AttrListValues>-->
<!--                  <pub:AttrListValue>-->
<!--                     <pub:Type>Provider</pub:Type>-->
<!--                     <pub:ValueId>2091</pub:ValueId>-->
<!--                  </pub:AttrListValue>-->
<!--               </pub:AttrListValues>-->
<!--               <pub:AttrValues>-->
<!--                  <pub:AttrValue>-->
<!--                     <pub:AttrValueType>SparePart_IsBasedOn</pub:AttrValueType>-->
<!--                     <pub:Translations>-->
<!--                        <pub:Translation>-->
<!--                           <pub:LanguageId>859</pub:LanguageId>-->
<!--                           <pub:Value>DQ_SSO_DOC_2</pub:Value>-->
<!--                        </pub:Translation>-->
<!--                     </pub:Translations>-->
<!--                  </pub:AttrValue>-->
<!--               </pub:AttrValues>-->
<!--               <pub:Url>https://www.traceparts.com//ws/schneider_electric_ws/product.aspx?PartFamilyId=10-16102014-116365</pub:Url>-->
            </pub:publishedDocument>
         </pub:publishEvent>
      </pub:CommunicatePublishChangeEvent>
   </soapenv:Body>
</soapenv:Envelope>